salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
months = 10  # Количество месяцев, которое планируется протянуть без долгов
increase = 0.05  # Ежемесячный рост цен

# TODO Рассчитайте подушку безопасности, чтобы протянуть 10 месяцев без долгов

month = 0
budget = 0
for i in range(0,months+1):
    month+=1
    budget = budget + salary - spend*(1 + 0.05*i)

money_capital = -budget

print(f"Подушка безопасности, чтобы протянуть {months} месяцев без долгов:", money_capital)
#если проверить на 1 задании, то всё норм)