money_capital = 20000  # Подушка безопасности
salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
increase = 0.05  # Ежемесячный рост цен

# TODO Посчитайте количество  месяцев, которое можно протянуть без долгов

budget = money_capital
months = 0
k = 0
while budget >= 0:
    months += 1
    budget = budget + salary - spend * (1+0.05*k)
    k+=1

months-=1
print("Количество месяцев, которое можно протянуть без долгов:", months, budget)
 # Конечный budget отображает сколько надо взять в долг, чтобы закрыть все траты в крайнем месяце,
 # но он(месяц) в подсчет не идет(по заданию)